
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстОрганиченияДоступа = Параметры.ТекущийТекстОграничения;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Завершить(Команда)
	
	Если ПустаяСтрока(ТекстОрганиченияДоступа) Тогда
		
		ПоказатьПредупреждение(,
			НСтр("ru = 'Нельзя записать пустое ограничение доступа.'"));
		Возврат;
		
	КонецЕсли;
	
	Закрыть(ТекстОрганиченияДоступа);
	
КонецПроцедуры

#КонецОбласти