///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстОрганиченияДоступа = Параметры.ТекущийТекстОграничения;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Завершить(Команда)
	
	Если ПустаяСтрока(ТекстОрганиченияДоступа) Тогда
		
		ПоказатьПредупреждение(,
			НСтр("ru = 'Нельзя записать пустое ограничение доступа.'"));
		Возврат;
		
	КонецЕсли;
	
	Закрыть(ТекстОрганиченияДоступа);
	
КонецПроцедуры

#КонецОбласти