///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2025, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРолиКонфигурации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРолиКонфигурации

&НаКлиенте
Процедура РолиКонфигурацииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Закрыть(РолиКонфигурации.Получить(Значение).Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
&НаСервере
Процедура ЗаполнитьРолиКонфигурации()
		
	Для Каждого ТекущаяРоль Из Метаданные.Роли Цикл
		
		РолиКонфигурации.Добавить(
			ТекущаяРоль.Имя,
			?(ПустаяСтрока(ТекущаяРоль.Синоним), ТекущаяРоль.Имя, ТекущаяРоль.Синоним));
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
