

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРолиКонфигурации();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыРолиКонфигурации

&НаКлиенте
Процедура РолиКонфигурацииВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Закрыть(РолиКонфигурации.Получить(Значение).Значение);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
	
&НаСервере
Процедура ЗаполнитьРолиКонфигурации()
		
	Для Каждого ТекущаяРоль Из Метаданные.Роли Цикл
		
		РолиКонфигурации.Добавить(
			ТекущаяРоль.Имя,
			?(ПустаяСтрока(ТекущаяРоль.Синоним), ТекущаяРоль.Имя, ТекущаяРоль.Синоним));
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
