
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ИмяМетаданныхПоВидуМетаданных(ВидМетаданных) Экспорт
	
	Возврат гпр_РаботаСКонфигурациейСерверПовтИсп.ИменаВидовМетаданныхВЕдинственномЧисле().Получить(ВидМетаданных);
	
КонецФункции

Функция ИмяВидаОбъектаПоВидуМетаданных(ВидМетаданных) Экспорт
	
	Возврат гпр_РаботаСКонфигурациейСерверПовтИсп.ИменаВидовМетаданныхВоМножественномЧисле().Получить(ВидМетаданных);
	
КонецФункции

Функция КартинкаМетаданных(ВидМетаданных) Экспорт
	
	Возврат гпр_РаботаСКонфигурациейСерверПовтИсп.КартинкиМетаданных().Получить(ВидМетаданных);
	
КонецФункции

Функция ИмяМетаданныхПоВидуМетаданныхДляРасширения(ВидМетаданных) Экспорт
	
	Возврат гпр_РаботаСКонфигурациейСерверПовтИсп.ИменаМетаданныхПоВидуМетаданныхДляРасширения().Получить(ВидМетаданных);
	
КонецФункции

Функция ИмяВидаОбъектаПоВидуМетаданныхДляРасширения(ВидМетаданных) Экспорт
	
	Возврат гпр_РаботаСКонфигурациейСерверПовтИсп.ИменаВидаОбъектаПоВидуМетаданныхДляРасширения().Получить(ВидМетаданных);
	
КонецФункции

Функция ВидОбъектаПоИмениМетаданныхРасширения(ИмяОбъекта) Экспорт
	
	Возврат гпр_РаботаСКонфигурациейСерверПовтИсп.ВидыОбъектовПоИмениМетаданныхРасширения().Получить(ИмяОбъекта);
	
КонецФункции

#КонецОбласти

#КонецЕсли
