
#Область ПрограммныйИнтерфейс

// См. гпр_ИспортЭкспортРолей.СохранитьРоли
Процедура СохранитьРолиНаДиск(Знач Роли) Экспорт
	
	Результат = гпр_ИспортЭкспортРолейВызовСервера.СохранитьРоли(Роли);
	НачатьПолучениеФайлаССервера(Результат, "Роли.json");
	
КонецПроцедуры

// Разбор файла с ролями в формате json и запись данных в базу.
// 
// Параметры:
//  УникальныйИдентификаторФормы - УникальныйИдентификатор - Уникальный идентификатор формы для сохранения во временном
//                                                           хранилище
Процедура ЗагрузитьРоли(УникальныйИдентификаторФормы) Экспорт
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьРолиЗавершениеЗагрузкиФайла", гпр_ИспортЭкспортРолейКлиент);
	НачатьПомещениеФайлаНаСервер(ОписаниеОповещения,,,,, УникальныйИдентификаторФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗагрузитьРолиЗавершениеЗагрузкиФайла(ОписаниеПомещенногоФайла, ДополнительныеПараметры) Экспорт
	
	Если ОписаниеПомещенногоФайла = Неопределено Или ОписаниеПомещенногоФайла.ПомещениеФайлаОтменено Тогда
		
		Возврат;
		
	КонецЕсли;
	
	гпр_ИспортЭкспортРолейВызовСервера.ЗагрузитьРоли(ОписаниеПомещенногоФайла.Адрес);
	ПоказатьПредупреждение(, "Загрузка ролей завершена");
	
КонецПроцедуры

#КонецОбласти