///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2024, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Обпределяет зависимость прав на объекты друг от друга. Например, при установке Добавления необходимо предоставить
// доступ на Чтение объекта.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//  * Ключ - Строка
//  * Значение - Массив из Строка
//
Функция ЗависимыеПраваДоступа() Экспорт
	
	Результат = Новый Соответствие();
	Результат.Вставить("Добавление", СтрРазделить("Чтение", ","));
	Результат.Вставить("Изменение", СтрРазделить("Чтение", ","));
	Результат.Вставить("Удаление", СтрРазделить("Чтение", ","));
	Результат.Вставить("Проведение", СтрРазделить("Чтение,Изменение", ","));
	Результат.Вставить("ОтменаПроведения", СтрРазделить("Чтение,Изменение", ","));
	Результат.Вставить("Просмотр", СтрРазделить("Чтение", ","));
	Результат.Вставить(
		"ИнтерактивноеДобавление",
		СтрРазделить("Чтение,Редактирование,Просмотр,Изменение,Добавление", ",")
	);
	Результат.Вставить("Редактирование", СтрРазделить("Чтение,Просмотр,Изменение", ","));
	Результат.Вставить("ИнтерактивноеУдаление", СтрРазделить("Чтение,Редактирование,Просмотр,Удаление,Изменение", ","));
	Результат.Вставить("ИнтерактивнаяПометкаНаУдаление", СтрРазделить("Чтение,Редактирование,Просмотр,Изменение", ","));
	Результат.Вставить(
		"ИнтерактивноеСнятиеПометкиУдаления",
		СтрРазделить("Чтение,Редактирование,Просмотр,Изменение", ",")
	);
	Результат.Вставить(
		"ИнтерактивноеУдалениеПомеченных",
		СтрРазделить("Чтение,Редактирование,Просмотр,Изменение,Удаление", ",")
	);
	Результат.Вставить("ВводПоСтроке", СтрРазделить("Чтение,Просмотр", ","));
	Результат.Вставить(
		"ИнтерактивноеУдалениеПредопределенных",
		СтрРазделить("Чтение,Редактирование,Просмотр,Изменение,Удаление,ИнтерактивноеУдаление", ",")
	);
	Результат.Вставить(
		"ИнтерактивнаяПометкаНаУдалениеПредопределенных",
		СтрРазделить("Чтение,Редактирование,Просмотр,Изменение,ИнтерактивнаяПометкаНаУдаление", ",")
	);
	Результат.Вставить(
		"ИнтерактивноеСнятиеПометкиУдаленияПредопределенных",
		СтрРазделить("Чтение,Редактирование,Просмотр,Изменение,ИнтерактивноеСнятиеПометкиУдаления", ",")
	);
	Результат.Вставить(
		"ИнтерактивноеУдалениеПомеченныхПредопределенных",
		СтрРазделить("Чтение,Удаление,Редактирование,Просмотр,Изменение,ИнтерактивноеУдалениеПомеченных", ",")
	);
	Результат.Вставить(
		"ИнтерактивноеПроведение",
		СтрРазделить("Чтение,Изменение,Проведение,Редактирование,Просмотр", ",")
	);
	Результат.Вставить(
		"ИнтерактивноеПроведениеНеОперативное",
		СтрРазделить("Чтение,Изменение,Проведение,Редактирование,Просмотр,ИнтерактивноеПроведение", ",")
	);
	Результат.Вставить(
		"ИнтерактивнаяОтменаПроведения",
		СтрРазделить("Чтение,Изменение,ОтменаПроведения,Редактирование,Просмотр", ",")
	);
	Результат.Вставить(
		"ИнтерактивноеИзменениеПроведенных",
		СтрРазделить("Чтение,Изменение,Редактирование,Просмотр", ",")
	);
	Результат.Вставить("ЧтениеИсторииДанных", СтрРазделить("Чтение", ","));
	Результат.Вставить("ЧтениеИсторииДанныхОтсутствующихДанных", СтрРазделить("Чтение,ЧтениеИсторииДанных", ","));
	Результат.Вставить("ИзменениеИсторииДанных", СтрРазделить("Чтение,ЧтениеИсторииДанных", ","));
	Результат.Вставить(
		"ИзменениеИсторииДанныхОтсутсвующихДанных",
		СтрРазделить("Чтение,ЧтениеИсторииДанных,ЧтениеИсторииДанныхОтсутствующихДанных,ИзменениеИсторииДанных", ",")
	);
	Результат.Вставить("ИзменениеКомментарияВерсииИсторииДанных", СтрРазделить("Чтение,ЧтениеИсторииДанных", ","));
	Результат.Вставить("ПросмотрИсторииДанных", СтрРазделить("Чтение,Просмотр,ЧтениеИсторииДанных", ","));
	Результат.Вставить(
		"РедактированияКомментарияВерсииИсторииДанных",
		СтрРазделить("Чтение,Просмотр,ЧтениеИсторииДанных,ИзменениеКомментарияВерсииИсторииДанных", ",")
	);
	Результат.Вставить("ПереходНаВерсиюИсторииДанных", СтрРазделить("Чтение,Просмотр", ","));
	Результат.Вставить("ОбщееЧтение", СтрРазделить("Чтение,Просмотр,ВводПоСтроке,Использование,Получение", ","));
	
	РеквизитыИзменения = Новый Массив();
	РеквизитыИзменения.Добавить("ВводПоСтроке");
	РеквизитыИзменения.Добавить("Просмотр");
	РеквизитыИзменения.Добавить("Чтение");
	РеквизитыИзменения.Добавить("Использование");
	РеквизитыИзменения.Добавить("Получение");
	РеквизитыИзменения.Добавить("Добавление");
	РеквизитыИзменения.Добавить("Изменение");
	РеквизитыИзменения.Добавить("ИнтерактивнаяОтменаПроведения");
	РеквизитыИзменения.Добавить("ИнтерактивноеДобавление");
	РеквизитыИзменения.Добавить("ИнтерактивноеПроведение");
	РеквизитыИзменения.Добавить("ИнтерактивноеПроведениеНеОперативное");
	РеквизитыИзменения.Добавить("ОтменаПроведения");
	РеквизитыИзменения.Добавить("Проведение");
	РеквизитыИзменения.Добавить("Редактирование");
	РеквизитыИзменения.Добавить("Установка");
	РеквизитыИзменения.Добавить("ИнтерактивноеИзменениеПроведенных");
	Результат.Вставить("ОбщееИзменение", РеквизитыИзменения);
	
	РеквизитыУдаления = Новый Массив();
	РеквизитыУдаления.Добавить("ВводПоСтроке");
	РеквизитыУдаления.Добавить("Просмотр");
	РеквизитыУдаления.Добавить("Чтение");
	РеквизитыУдаления.Добавить("Использование");
	РеквизитыУдаления.Добавить("Получение");
	РеквизитыУдаления.Добавить("Добавление");
	РеквизитыУдаления.Добавить("Изменение");
	РеквизитыУдаления.Добавить("ИнтерактивнаяОтменаПроведения");
	РеквизитыУдаления.Добавить("ИнтерактивноеДобавление");
	РеквизитыУдаления.Добавить("ИнтерактивноеПроведение");
	РеквизитыУдаления.Добавить("ИнтерактивноеПроведениеНеОперативное");
	РеквизитыУдаления.Добавить("ОтменаПроведения");
	РеквизитыУдаления.Добавить("Проведение");
	РеквизитыУдаления.Добавить("Редактирование");
	РеквизитыУдаления.Добавить("Установка");
	РеквизитыУдаления.Добавить("Удаление");
	РеквизитыУдаления.Добавить("ИнтерактивнаяПометкаНаУдаление");
	РеквизитыУдаления.Добавить("ИнтерактивноеСнятиеПометкиУдаления");
	РеквизитыУдаления.Добавить("ИнтерактивноеИзменениеПроведенных");
	Результат.Вставить("ОбщееУдаление", РеквизитыУдаления);
	
	Возврат Результат;
	
КонецФункции

Функция СвязьРеквизитовПростогоИЭкспертногоРежимов() Экспорт
	
	РеквизитыЧтения = Новый Массив();
	РеквизитыЧтения.Добавить("ВводПоСтроке");
	РеквизитыЧтения.Добавить("Просмотр");
	РеквизитыЧтения.Добавить("Чтение");
	РеквизитыЧтения.Добавить("Использование");
	РеквизитыЧтения.Добавить("Получение");
	Результат = Новый Структура("ОбщееЧтение", РеквизитыЧтения);
	
	РеквизитыИзменения = Новый Массив();
	РеквизитыИзменения.Добавить("Добавление");
	РеквизитыИзменения.Добавить("Изменение");
	РеквизитыИзменения.Добавить("ИнтерактивнаяОтменаПроведения");
	РеквизитыИзменения.Добавить("ИнтерактивноеДобавление");
	РеквизитыИзменения.Добавить("ИнтерактивноеПроведение");
	РеквизитыИзменения.Добавить("ИнтерактивноеПроведениеНеОперативное");
	РеквизитыИзменения.Добавить("ИнтерактивноеИзменениеПроведенных");
	РеквизитыИзменения.Добавить("ОтменаПроведения");
	РеквизитыИзменения.Добавить("Проведение");
	РеквизитыИзменения.Добавить("Редактирование");
	РеквизитыИзменения.Добавить("Установка");
	РеквизитыИзменения.Добавить("ОбщееЧтение");
	Результат.Вставить("ОбщееИзменение", РеквизитыИзменения);
	
	РеквизитыУдаления = Новый Массив();
	РеквизитыУдаления.Добавить("Удаление");
	РеквизитыУдаления.Добавить("ИнтерактивнаяПометкаНаУдаление");
	РеквизитыУдаления.Добавить("ИнтерактивноеСнятиеПометкиУдаления");
	РеквизитыУдаления.Добавить("ОбщееЧтение");
	РеквизитыУдаления.Добавить("ОбщееИзменение");
	Результат.Вставить("ОбщееУдаление", РеквизитыУдаления);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти