
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Получим пользователей ИБ
	СписокПользователей = ПользователиИнформационнойБазы.ПолучитьПользователей();
	СписокВыбораПользователей = Элементы.гпр_ПользовательБазы.СписокВыбора;
	
	Для Каждого ТекущийПользователь Из СписокПользователей Цикл
		СписокВыбораПользователей.Добавить(ТекущийПользователь.Имя);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если Не ЗакрытьБезЗаписиНастроек
		И Не ЗначениеЗаполнено(НаборКонстант.гпр_ПользовательБазы) Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ОбработчикОповещения = Новый ОписаниеОповещения("ЗавершениеВопросаОЗакрытииНастроек", ЭтотОбъект);
		ПоказатьВопрос(
			ОбработчикОповещения,
			НСтр("ru = 'Закрытие формы приведет к отмене установки расширения. Продолжить?'"),
			РежимДиалогаВопрос.ДаНет);
		Возврат;
	ИначеЕсли ЗакрытьБезЗаписиНастроек Тогда
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНастройки(Команда)
	
	Записать();
	ЗакрытьБезЗаписиНастроек = Истина;
	Закрыть();
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗавершениеВопросаОЗакрытииНастроек(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗакрытьБезЗаписиНастроек = Истина;
		Результат = Новый Структура();
		Результат.Вставить("ПрерватьУстановкуРасширения", Истина);
		Закрыть(Результат);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
