///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2022-2024, ООО 1С-Рарус
// Все права защищены. Эта программа и сопроводительные материалы предоставляются
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// См. гпр_ИспортЭкспортРолей.СохранитьРоли
Функция СохранитьРоли(Роли) Экспорт
	
	Возврат гпр_ИспортЭкспортРолей.СохранитьРоли(Роли);
	
КонецФункции

// См. гпр_ИспортЭкспортРолей.ЗагрузитьРоли
Процедура ЗагрузитьРоли(АдресФайла) Экспорт
	
	гпр_ИспортЭкспортРолей.ЗагрузитьРоли(АдресФайла);
	
КонецПроцедуры

#КонецОбласти